In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
ds = pd.Series([1.0, 3.5, 4.6, 7.8])

In [3]:
ds

0    1.0
1    3.5
2    4.6
3    7.8
dtype: float64

In [5]:
ds[1]

3.5

In [ ]:
np.random.randn(10)

In [6]:
np.random.randn(10)*10 + 30

array([25.39319826, 37.84345454, 19.30892857, 28.56567259, 13.00882304,
       41.67110822, 18.97112709, 23.36984051, 31.80170611, 28.82979712])

In [9]:
df = pd.DataFrame( {"names":["Samudra", "Sagar", "Alice", "Bob", "Ekman", "Munk", "Sindhu", "Tharp", "McBoaty", "Earle"], 
                    "age": np.random.randn(10)*10 + 30, 
                    "weight":np.random.randn(10)*25 + 75, 
                    "university":["Unseen", "Mangalore", "Goa", "Mangalore", "Unseen", "Unseen", "Goa", "Mangalore", "Unseen", "Unseen"]},
                 index=["A", "B", "C", "D", "E", "F", "G", "H", "I", "J"])

#

In [10]:
df

     names        age      weight university
A  Samudra  17.754797   55.178252     Unseen
B    Sagar  33.991695   86.186562  Mangalore
C    Alice  23.096815   53.491667        Goa
D      Bob  35.695195  129.501552  Mangalore
E    Ekman  27.835256   62.327465     Unseen
F     Munk  35.457222   95.887130     Unseen
G   Sindhu  30.569853   67.007399        Goa
H    Tharp  27.798669   79.685803  Mangalore
I  McBoaty  33.280810  122.679363     Unseen
J    Earle  34.655369   81.417911     Unseen

In [11]:
df.columns

Index(['names', 'age', 'weight', 'university'], dtype='object')

In [12]:
df.index

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'], dtype='object')

In [19]:
df.iloc[0:5]["names"]

A    Samudra
B      Sagar
C      Alice
D        Bob
E      Ekman
Name: names, dtype: object

In [20]:
df.loc[["A","J"], "age"]

A    17.754797
J    34.655369
Name: age, dtype: float64

In [21]:
df.iloc[[0, 9]]

     names        age     weight university
A  Samudra  17.754797  55.178252     Unseen
J    Earle  34.655369  81.417911     Unseen

#### Defining your own index, rather than the default index of 0...N may be useful when you need to organize data logically, for example time series data can use the time as index
But luckily, you also have access to the 0...N index by using the "iloc" selector

In [23]:
df.loc[:, "age"]

A    17.754797
B    33.991695
C    23.096815
D    35.695195
E    27.835256
F    35.457222
G    30.569853
H    27.798669
I    33.280810
J    34.655369
Name: age, dtype: float64

In [24]:
df["weight"].values # .values returns the column as an array

array([ 55.17825248,  86.18656232,  53.49166689, 129.50155239,
        62.32746525,  95.88712998,  67.00739914,  79.68580283,
       122.67936326,  81.41791051])

In [25]:
df.describe()

             age      weight
count  10.000000   10.000000
mean   30.013568   83.336311
std     5.944560   26.359360
min    17.754797   53.491667
25%    27.807816   63.497449
50%    31.925332   80.551857
75%    34.489451   93.461988
max    35.695195  129.501552

In [27]:
df["university"]

A       Unseen
B    Mangalore
C          Goa
D    Mangalore
E       Unseen
F       Unseen
G          Goa
H    Mangalore
I       Unseen
J       Unseen
Name: university, dtype: object

In [26]:
df["university"].unique()

array(['Unseen', 'Mangalore', 'Goa'], dtype=object)

In [28]:
df["university"] == "Unseen"

A     True
B    False
C    False
D    False
E     True
F     True
G    False
H    False
I     True
J     True
Name: university, dtype: bool

In [29]:
sel_UU = (df["university"] == "Unseen")
df.loc[sel_UU] # You can use boolean selectors to select slices of the dataframe

     names        age      weight university
A  Samudra  17.754797   55.178252     Unseen
E    Ekman  27.835256   62.327465     Unseen
F     Munk  35.457222   95.887130     Unseen
I  McBoaty  33.280810  122.679363     Unseen
J    Earle  34.655369   81.417911     Unseen

In [35]:
df.loc[:, ["university", "weight", "age"]].groupby("university").mean()

               weight        age
university
Goa         60.249533  26.833334
Mangalore   98.457973  32.495187
Unseen      83.498024  29.796691

In [ ]:
df.loc[:, ["age", "weight", "university"]].groupby("university").mean()

In [36]:
df.loc[:, ["age", "weight", "university"]].groupby("university").std()

                 age     weight
university
Goa         5.284236   9.557066
Mangalore   4.155531  27.080304
Unseen      7.359380  27.125616

In [37]:
df.loc[df["age"] > 25]

     names        age      weight university
B    Sagar  33.991695   86.186562  Mangalore
D      Bob  35.695195  129.501552  Mangalore
E    Ekman  27.835256   62.327465     Unseen
F     Munk  35.457222   95.887130     Unseen
G   Sindhu  30.569853   67.007399        Goa
H    Tharp  27.798669   79.685803  Mangalore
I  McBoaty  33.280810  122.679363     Unseen
J    Earle  34.655369   81.417911     Unseen

In [38]:
df.loc[df["age"] > 25, "names"]

B      Sagar
D        Bob
E      Ekman
F       Munk
G     Sindhu
H      Tharp
I    McBoaty
J      Earle
Name: names, dtype: object

In [43]:
df["age"] > 25

A    False
B     True
C    False
D     True
E     True
F     True
G     True
H     True
I     True
J     True
Name: age, dtype: bool

In [45]:
df.loc[df["age"] > 25 ]

     names        age      weight university
B    Sagar  33.991695   86.186562  Mangalore
D      Bob  35.695195  129.501552  Mangalore
E    Ekman  27.835256   62.327465     Unseen
F     Munk  35.457222   95.887130     Unseen
G   Sindhu  30.569853   67.007399        Goa
H    Tharp  27.798669   79.685803  Mangalore
I  McBoaty  33.280810  122.679363     Unseen
J    Earle  34.655369   81.417911     Unseen

In [46]:
df.loc[df["age"] > 25, "weight"] * 1.25

B    107.733203
D    161.876940
E     77.909332
F    119.858912
G     83.759249
H     99.607254
I    153.349204
J    101.772388
Name: weight, dtype: float64

In [ ]:
df.loc[df["age"] > 25, "weight"] = df.loc[df["age"] > 25, "weight"] * 1.25

In [ ]:
df

#### You can define your own functions and perform operations on grouped dataframes using "apply"

Let's say that a magical accident ages everyone at Unseen University by 25 years, we can update our dataframe by grouping it by "university" and then adding 25 years to the ages of those in UU.

In [ ]:
def increase_age(gdf, addYears=25):
    if gdf.university[0] == "Unseen": # conditional statement to perform the operation only on Unseen University members
        gdf.loc[:, "age"] = gdf["age"] + addYears
    return gdf

In [ ]:
df = df.groupby("university").apply(increase_age)

In [ ]:
df

In [ ]:
df.groupby(pd.cut(df["age"], [20,30,40,50,60,70])).count()

pd.cut() function allows us to bin the data. You pass the column followed by the bins and then call a function that operates on the grouped dataframe.

### Exercise 05: Practise groupby operations

1. Groupby university name and use the following functions: count, mean, std, describe
1. Groupby weight, binned in (0,50], (50, 100], (100,150], (150, 200] bins and call the count and mean functions.
1. Can you draw a flowchart describing the groupby() and apply() operation? Discuss this with your group members!